In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import openpyxl as op

In [2]:
sheets=pd.read_excel('Regional Sales Dataset.xlsx',sheet_name=None)

In [3]:
sheets

{'Sales Orders':         OrderNumber  OrderDate  Customer Name Index      Channel  \
 0       SO - 000225 2014-01-01                  126    Wholesale
 1      SO - 0003378 2014-01-01                   96  Distributor
 2      SO - 0005126 2014-01-01                    8    Wholesale
 3      SO - 0005614 2014-01-01                   42       Export
 4      SO - 0005781 2014-01-01                   73    Wholesale
 ...             ...        ...                  ...          ...
 64099  SO - 0007573 2018-02-28                   74    Wholesale
 64100  SO - 0007706 2018-02-28                   51       Export
 64101  SO - 0007718 2018-02-28                  136  Distributor
 64102  SO - 0008084 2018-02-28                  158  Distributor
 64103  SO - 0008654 2018-02-28                   22  Distributor

       Currency Code Warehouse Code  Delivery Region Index  \
 0               USD         AXW291                    364
 1               USD         AXW291                    488
 2               USD         AXW291                    155
 3               USD         AXW291                    473
 4               USD         AXW291                    256
 ...             ...            ...                    ...
 64099           USD         AXW291                    825
 64100           USD         NXH382                    444
 64101           USD         AXW291                    312
 64102           USD         AXW291                    737
 64103           USD         AXW291                    807

        Product Description Index  Order Quantity  Unit Price  Line Total  \
 0                             27               6      2499.1     14994.6
 1                             20              11      2351.7     25868.7
 2                             26               6       978.2      5869.2
 3                              7               7      2338.3     16368.1
 4                              8               8      2291.4     18331.2
 ...                          ...             ...         ...         ...
 64099                         26              12      1815.7     21788.4
 64100                         21               6       864.3      5185.8
 64101                         13              11      3953.0     43483.0
 64102                         20               7      3959.7     27717.9
 64103                         15               8       998.3      7986.4

        Total Unit Cost
 0             1824.343
 1             1269.918
 2              684.740
 3             1028.852
 4             1260.270
 ...                ...
 64099          980.478
 64100          579.081
 64101         2648.510
 64102         2930.178
 64103          848.555

 [64104 rows x 12 columns],
 'Customers':      Customer Index Customer Names
 0                 1  Geiss Company
 1                 2  Jaxbean Group
 2                 3     Ascend Ltd
 3                 4      Eire Corp
 4                 5   Blogtags Ltd
 ..              ...            ...
 170             171   Accord Group
 171             172   BB17 Company
 172             173          H Ltd
 173             174   Tekfly Group
 174             175   SHISEIDO Ltd

 [175 rows x 2 columns],
 'Regions':       id        name                                   county state_code  \
 0      1      Auburn                               Lee County         AL
 1      2  Birmingham           Shelby County/Jefferson County         AL
 2      3     Decatur           Limestone County/Morgan County         AL
 3      4      Dothan  Dale County/Houston County/Henry County         AL
 4      5      Hoover           Shelby County/Jefferson County         AL
 ..   ...         ...                                      ...        ...
 989  990      Racine                            Racine County         WI
 990  991    Waukesha                          Waukesha County         WI
 991  992  West Allis                         Milwaukee County         WI
 992  993      Casper                           Natrona County         WY
 993  994    Cheyenne                           Laramie County         WY

          state  type  latitude  longitude  area_code  population  households  \
 0      Alabama  City  32.60986  -85.48078        334       62059       21767
 1      Alabama  City  33.52744  -86.79905        205      212461       89972
 2      Alabama  City  34.57332  -86.99214        256       55437       22294
 3      Alabama  City  31.23370  -85.40682        334       68567       25913
 4      Alabama  City  33.37695  -86.80558        205       84848       32789
 ..         ...   ...       ...        ...        ...         ...         ...
 989  Wisconsin  City  42.72613  -87.78285        262       77742       29851
 990  Wisconsin  City  43.01168  -88.23148        262       71970       28331
 991  Wisconsin  City  43.01668  -88.00703        414       60620       27457
 992    Wyoming  City  42.86663 -106.31308        307       60285       23814
 993    Wyoming  City  41.13998 -104.82025        307       63335       25130

      median_income  land_area  water_area        time_zone
 0            38342  152375113     2646161  America/Chicago
 1            31061  378353942     6591013  America/Chicago
 2            41496  141006257    17594716  America/Chicago
 3            42426  232166237      835468  America/Chicago
 4            77146  122016784     2553332  America/Chicago
 ..             ...        ...         ...              ...
 989          41455   40111757     8282116  America/Chicago
 990          59547   65856921      700602  America/Chicago
 991          45221   29480532       60789  America/Chicago
 992          57790   68507280      911081   America/Denver
 993          58219   69964749      282335   America/Denver

 [994 rows x 15 columns],
 'State Regions':        Column1               Column2    Column3
 0   State Code                 State     Region
 1           AL               Alabama      South
 2           AR              Arkansas      South
 3           AZ               Arizona       West
 4           CA            California       West
 5           CO              Colorado       West
 6           CT           Connecticut  Northeast
 7           DC  District of Columbia      South
 8           DE              Delaware      South
 9           FL               Florida      South
 10          GA               Georgia      South
 11          HI                Hawaii       West
 12          IA                  Iowa    Midwest
 13          ID                 Idaho       West
 14          IL              Illinois    Midwest
 15          IN               Indiana    Midwest
 16          KS                Kansas    Midwest
 17          KY              Kentucky      South
 18          LA             Louisiana      South
 19          MA         Massachusetts  Northeast
 20          MD              Maryland      South
 21          ME                 Maine  Northeast
 22          MI              Michigan    Midwest
 23          MN             Minnesota    Midwest
 24          MO              Missouri    Midwest
 25          MS           Mississippi      South
 26          MT               Montana       West
 27          NC        North Carolina      South
 28          ND          North Dakota    Midwest
 29          NE              Nebraska    Midwest
 30          NH         New Hampshire  Northeast
 31          NJ            New Jersey  Northeast
 32          NM            New Mexico       West
 33          NV                Nevada       West
 34          NY              New York  Northeast
 35          OH                  Ohio    Midwest
 36          OK              Oklahoma      South
 37          OR                Oregon       West
 38          PA          Pennsylvania  Northeast
 39          RI          Rhode Island  Northeast
 40          SC        South Carolina      South
 41          SD          South Dakota    Midwest
 42          TN             Tennessee      South
 43          TX                 Texas      South
 44          UT                  Utah       West
 45          VA              Virginia      South
 46          WA            Washington       West
 47          WI             Wisconsin    Midwest
 48          WY               Wyoming       West,
 'Products':     Index Product Name
 0       1    Product 1
 1       2    Product 2
 2       3    Product 3
 3       4    Product 4
 4       5    Product 5
 5       6    Product 6
 6       7    Product 7
 7       8    Product 8
 8       9    Product 9
 9      10   Product 10
 10     11   Product 11
 11     12   Product 12
 12     13   Product 13
 13     14   Product 14
 14     15   Product 15
 15     16   Product 16
 16     17   Product 17
 17     18   Product 18
 18     19   Product 19
 19     20   Product 20
 20     21   Product 21
 21     22   Product 22
 22     23   Product 23
 23     24   Product 24
 24     25   Product 25
 25     26   Product 26
 26     27   Product 27
 27     28   Product 28
 28     29   Product 29
 29     30   Product 30,
 '2017 Budgets':    Product Name  2017 Budgets
 0     Product 1   3016489.209
 1     Product 2   3050087.565
 2     Product 3   2642352.432
 3     Product 4   2885560.824
 4     Product 5   3925424.542
 5     Product 6   1672229.416
 6     Product 7    889737.555
 7     Product 8   1085037.329
 8     Product 9    710415.405
 9    Product 10    864331.624
 10   Product 11   1230458.484
 11   Product 12   1356976.996
 12   Product 13   3720639.645
 13   Product 14   4028698.409
 14   Product 15   3299478.315
 15   Product 16   2062061.144
 16   Product 17   2119616.824
 17   Product 18   2309499.045
 18   Product 19   1645841.600
 19   Product 20   2067108.120
 20   Product 21    959899.218
 21   Product 22    663601.902
 22   Product 23   1135815.758
 23   Product 24    756557.970
 24   Product 25   5342315.484
 25   Product 26   5685138.270
 26   Product 27    964940.231
 27   Product 28   1003867.767
 28   Product 29    594471.570
 29   Product 30   1011609.684}

In [4]:
#Assigning dataframe to each sheet
df_sales=sheets['Sales Orders']
df_customers=sheets['Customers']
df_products=sheets['Products']
df_regions=sheets['Regions']
df_state_reg=sheets['State Regions']
df_budgets=sheets['2017 Budgets']

In [5]:
print('df_sales shape:',(df_sales.shape))
print('df_customers shape:',(df_customers.shape))
print('df_products shape:',(df_products.shape))
print('df_regions shape:',(df_regions.shape))
print('df_state_reg shape:',(df_state_reg.shape))
print('df_budgets shape:',(df_budgets.shape))

df_sales shape: (64104, 12)
df_customers shape: (175, 2)
df_products shape: (30, 2)
df_regions shape: (994, 15)
df_state_reg shape: (49, 3)
df_budgets shape: (30, 2)

In [6]:
#Changing the header of state_reg dataframe
new_header=df_state_reg.iloc[0]
df_state_reg.columns=new_header
df_state_reg=df_state_reg[1:].reset_index(drop=True)

df_state_reg.head(5)

0 State Code       State Region
0         AL     Alabama  South
1         AR    Arkansas  South
2         AZ     Arizona   West
3         CA  California   West
4         CO    Colorado   West

In [7]:
#Checking for null values in sales dataframe
df_sales.isnull().sum()

OrderNumber                  0
OrderDate                    0
Customer Name Index          0
Channel                      0
Currency Code                0
Warehouse Code               0
Delivery Region Index        0
Product Description Index    0
Order Quantity               0
Unit Price                   0
Line Total                   0
Total Unit Cost              0
dtype: int64

In [8]:
#Checking for null values in product dataframe
df_products.isnull().sum()

Index           0
Product Name    0
dtype: int64

In [9]:
#Checking for null values in customers dataframe
df_customers.isnull().sum()

Customer Index    0
Customer Names    0
dtype: int64

In [10]:
#Checking for null values in regions dataframe
df_regions.isnull().sum()

id               0
name             0
county           0
state_code       0
state            0
type             0
latitude         0
longitude        0
area_code        0
population       0
households       0
median_income    0
land_area        0
water_area       0
time_zone        0
dtype: int64

In [11]:
#Checking for null values in state_reg dataframe
df_state_reg.isnull().sum()

0
State Code    0
State         0
Region        0
dtype: int64

In [12]:
#Checking for null values in budget dataframe
df_budgets.isnull().sum()

Product Name    0
2017 Budgets    0
dtype: int64

Data Cleaning and Wrangling

In [13]:
#Merge with Customers
df=df_sales.merge(
    df_customers,
    how='left',
    left_on='Customer Name Index',
    right_on='Customer Index'
)

In [14]:
#Merge with Products
df=df.merge(
    df_products,
    how='left',
    left_on='Product Description Index',
    right_on='Index'
)

In [15]:
#Merge with Regions
df=df.merge(
    df_regions,
    how='left',
    left_on='Delivery Region Index',
    right_on='id'
)

In [16]:
df_state_reg = pd.read_excel("Regional Sales Dataset.xlsx", header=1)

In [17]:
df_state_reg = pd.read_excel(
    "Regional Sales Dataset.xlsx",
    sheet_name="State Regions",
    header=1
)

# Cleaning column names
df_state_reg.columns = df_state_reg.columns.str.strip()

print(df_state_reg.columns)

Index(['State Code', 'State', 'Region'], dtype='str')

In [18]:
#Merge with State Regions
df=df.merge(
    df_state_reg[["State Code","Region"]],
    how='left',
    left_on='state_code',
    right_on='State Code'
)

In [19]:
print(df_budgets.columns)

Index(['Product Name', '2017 Budgets'], dtype='str')

In [20]:
print(df.columns)

Index(['OrderNumber', 'OrderDate', 'Customer Name Index', 'Channel',
       'Currency Code', 'Warehouse Code', 'Delivery Region Index',
       'Product Description Index', 'Order Quantity', 'Unit Price',
       'Line Total', 'Total Unit Cost', 'Customer Index', 'Customer Names',
       'Index', 'Product Name', 'id', 'name', 'county', 'state_code', 'state',
       'type', 'latitude', 'longitude', 'area_code', 'population',
       'households', 'median_income', 'land_area', 'water_area', 'time_zone',
       'State Code', 'Region'],
      dtype='str')

In [22]:
df.columns = df.columns.str.strip().str.lower()

In [23]:
print(df.columns)

Index(['ordernumber', 'orderdate', 'customer name index', 'channel',
       'currency code', 'warehouse code', 'delivery region index',
       'product description index', 'order quantity', 'unit price',
       'line total', 'total unit cost', 'customer index', 'customer names',
       'index', 'product name', 'id', 'name', 'county', 'state_code', 'state',
       'type', 'latitude', 'longitude', 'area_code', 'population',
       'households', 'median_income', 'land_area', 'water_area', 'time_zone',
       'state code', 'region'],
      dtype='str')

In [25]:
df = df.merge(
    df_budgets[['Product Name','2017 Budgets']],
    how='left',
    left_on='product name',
    right_on='Product Name'
)

In [26]:
df.rename(columns={'2017 Budgets':'budget'}, inplace=True)

In [27]:
df.head(5)

,ordernumber,orderdate,customer name index,channel,currency code,warehouse code,delivery region index,product description index,order quantity,unit price,...,population,households,median_income,land_area,water_area,time_zone,state code,region,Product Name,budget
0,SO - 000225,2014-01-01,126,Wholesale,USD,AXW291,364,27,6,2499.1,...,145674,52798,36466,268318796,13908113,America/New York,GA,South,Product 27,964940.231
1,SO - 0003378,2014-01-01,96,Distributor,USD,AXW291,488,20,11,2351.7,...,55586,20975,54176,72276415,1883,America/Indiana/Indianapolis,IN,Midwest,Product 20,2067108.120
2,SO - 0005126,2014-01-01,8,Wholesale,USD,AXW291,155,26,6,978.2,...,79510,26020,124759,62489257,386195,America/Los Angeles,CA,West,Product 26,5685138.270
3,SO - 0005614,2014-01-01,42,Export,USD,AXW291,473,7,7,2338.3,...,84067,30232,30019,60221613,475857,America/Indiana/Indianapolis,IN,Midwest,Product 7,889737.555
4,SO - 0005781,2014-01-01,73,Wholesale,USD,AXW291,256,8,8,2291.4,...,58007,24141,63158,70972793,720300,America/New York,CT,Northeast,Product 8,1085037.329

In [28]:
#Clean up redundant columns
cols_to_drop=['Customer Index','Index','id','State Code']
df=df.drop(columns=cols_to_drop,errors='ignore')

df.head(5)

,ordernumber,orderdate,customer name index,channel,currency code,warehouse code,delivery region index,product description index,order quantity,unit price,...,population,households,median_income,land_area,water_area,time_zone,state code,region,Product Name,budget
0,SO - 000225,2014-01-01,126,Wholesale,USD,AXW291,364,27,6,2499.1,...,145674,52798,36466,268318796,13908113,America/New York,GA,South,Product 27,964940.231
1,SO - 0003378,2014-01-01,96,Distributor,USD,AXW291,488,20,11,2351.7,...,55586,20975,54176,72276415,1883,America/Indiana/Indianapolis,IN,Midwest,Product 20,2067108.120
2,SO - 0005126,2014-01-01,8,Wholesale,USD,AXW291,155,26,6,978.2,...,79510,26020,124759,62489257,386195,America/Los Angeles,CA,West,Product 26,5685138.270
3,SO - 0005614,2014-01-01,42,Export,USD,AXW291,473,7,7,2338.3,...,84067,30232,30019,60221613,475857,America/Indiana/Indianapolis,IN,Midwest,Product 7,889737.555
4,SO - 0005781,2014-01-01,73,Wholesale,USD,AXW291,256,8,8,2291.4,...,58007,24141,63158,70972793,720300,America/New York,CT,Northeast,Product 8,1085037.329

In [29]:
df.columns=df.columns.str.lower()

df.columns.values

<StringArray>
[              'ordernumber',                 'orderdate',
       'customer name index',                   'channel',
             'currency code',            'warehouse code',
     'delivery region index', 'product description index',
            'order quantity',                'unit price',
                'line total',           'total unit cost',
            'customer index',            'customer names',
                     'index',              'product name',
                      'name',                    'county',
                'state_code',                     'state',
                      'type',                  'latitude',
                 'longitude',                 'area_code',
                'population',                'households',
             'median_income',                 'land_area',
                'water_area',                 'time_zone',
                'state code',                    'region',
              'product name',                    'budget']
Length: 34, dtype: str

In [30]:
df.rename(columns={
    'product name_x':'product name',
    'state_code_x':'state_code',
    'state_x':'state',
    'latitude_x':'latitude',
    'longitude_x':'longitude'
}, inplace=True)

In [33]:
#Keeping the important columns and dropping the other columns
cols_to_keep=[
    'ordernumber',
    'orderdate',          
    'customer names',     
    'channel',            
    'product name',       
    'order quantity',     
    'unit price',         
    'line total',         
    'total unit cost',    
    'state_code',         
    'state',              
    'region',             
    'latitude',           
    'longitude',          
    'budget' 
]

In [34]:
df=df[cols_to_keep]

In [35]:
print(df.columns)

Index(['ordernumber', 'orderdate', 'customer names', 'channel', 'product name',
       'product name', 'order quantity', 'unit price', 'line total',
       'total unit cost', 'state_code', 'state', 'region', 'latitude',
       'longitude', 'budget'],
      dtype='str')

In [36]:
#Converting column name to snake_case
df=df.rename(columns={
    'ordernumber':'order_number',   
    'orderdate':'order_date',     
    'customer names':'customer_name',  
    'product name':'product_name',   
    'order quantity':'quantity',       
    'unit price':'unit_price',     
    'line total':'revenue',        
    'total unit cost':'cost',           
    'state_code':'state',          
    'state':'state_name',     
    'region':'us_region',      
    'latitude':'lat',            
    'longitude':'lon',            
    '2017 budgets':'budget'   
})

In [37]:
df.head()

,order_number,order_date,customer_name,channel,product_name,product_name,quantity,unit_price,revenue,cost,state,state_name,us_region,lat,lon,budget
0,SO - 000225,2014-01-01,Rhynoodle Ltd,Wholesale,Product 27,Product 27,6,2499.1,14994.6,1824.343,GA,Georgia,South,32.08354,-81.09983,964940.231
1,SO - 0003378,2014-01-01,Thoughtmix Ltd,Distributor,Product 20,Product 20,11,2351.7,25868.7,1269.918,IN,Indiana,Midwest,39.61366,-86.10665,2067108.120
2,SO - 0005126,2014-01-01,Amerisourc Corp,Wholesale,Product 26,Product 26,6,978.2,5869.2,684.740,CA,California,West,37.66243,-121.87468,5685138.270
3,SO - 0005614,2014-01-01,Colgate-Pa Group,Export,Product 7,Product 7,7,2338.3,16368.1,1028.852,IN,Indiana,Midwest,39.16533,-86.52639,889737.555
4,SO - 0005781,2014-01-01,Deseret Group,Wholesale,Product 8,Product 8,8,2291.4,18331.2,1260.270,CT,Connecticut,Northeast,41.77524,-72.52443,1085037.329

In [38]:
df.loc[df['order_date'].dt.year!=2017,'budget']=pd.NA
df[['order_date','product_name','revenue','budget']].head(10)

  order_date product_name product_name  revenue  budget
0 2014-01-01   Product 27   Product 27  14994.6     NaN
1 2014-01-01   Product 20   Product 20  25868.7     NaN
2 2014-01-01   Product 26   Product 26   5869.2     NaN
3 2014-01-01    Product 7    Product 7  16368.1     NaN
4 2014-01-01    Product 8    Product 8  18331.2     NaN
5 2014-01-01   Product 23   Product 23  57412.3     NaN
6 2014-01-01    Product 1    Product 1  20120.1     NaN
7 2014-01-01   Product 25   Product 25  10452.0     NaN
8 2014-01-01   Product 13   Product 13  19262.5     NaN
9 2014-01-01   Product 14   Product 14  34974.0     NaN

In [39]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 64104 entries, 0 to 64103
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_number   64104 non-null  str
 1   order_date     64104 non-null  datetime64[us]
 2   customer_name  64104 non-null  str
 3   channel        64104 non-null  str
 4   product_name   64104 non-null  str
 5   product_name   64104 non-null  str
 6   quantity       64104 non-null  int64
 7   unit_price     64104 non-null  float64
 8   revenue        64104 non-null  float64
 9   cost           64104 non-null  float64
 10  state          64104 non-null  str
 11  state_name     64104 non-null  str
 12  us_region      64104 non-null  str
 13  lat            64104 non-null  float64
 14  lon            64104 non-null  float64
 15  budget         15263 non-null  float64
dtypes: datetime64[us](1), float64(6), int64(1), str(8)
memory usage: 7.8 MB

In [40]:
df.isnull().sum()

order_number         0
order_date           0
customer_name        0
channel              0
product_name         0
product_name         0
quantity             0
unit_price           0
revenue              0
cost                 0
state                0
state_name           0
us_region            0
lat                  0
lon                  0
budget           48841
dtype: int64